In [24]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import sidetable

In [25]:
df = pd.read_csv('utilizar_copia.csv', index_col=0)
df.head()

,case_number,year,type,country,area,location,activity,name,age,time,species_,injury,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,"FATAL, all onboard were killed by sharks",NaN,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,FATAL,May,Y,NaN
2,1792.09.12,1792,Provoked,england,NaN,On the Thames River,Fishing,male,NaN,NaN,NaN,"FATAL, PROVOKED INCIDENT",Sep,Y,M
3,1791.00.00,1791,Unprovoked,australia,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",NaN,NaN,NaN,"FATAL, ""bitten in two""",NaN,Y,F
4,1788.05.10,1788,Boat,australia,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,"No injury to occupants, shark bit oar and rudder",May,N,NaN

1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¿Hay alguna . columna con una gran cantidad de nulos? En caso de que sea así deberemos eliminarla.

In [26]:
df.stb.missing()

              missing  total    percent
time             3340   6284  53.150859
species_         2831   6284  45.050923
age              2820   6284  44.875875
fatal_clean       607   6284   9.659453
sexo              564   6284   8.975175
activity          542   6284   8.625080
location          539   6284   8.577339
fecha_limpia      526   6284   8.370465
area              454   6284   7.224698
name              209   6284   3.325907
country            50   6284   0.795672
injury             28   6284   0.445576
type                4   6284   0.063654
case_number         1   6284   0.015913
year                0   6284   0.000000

In [27]:
df['time'].unique()

array([nan, '22h00', '06h00', 'Night', '18h00', 'Morning', 'Afternoon',
       'Late afternoon', '14h00  -15h00', '07h45', '17h00', '14h00',
       '15h00', '08h15', '11h00', '10h30', '10h40', '16h50', '07h00',
       '09h30', '21h50', '09h40', '08h00', '17h35', '15h30', '07h30',
       '19h00, Dusk', '16h00', '15h01', '12h00', '13h45', '23h30',
       '09h00', '14h30', '18h30', '12h30', '16h30', '18h45', '10h00',
       '10h44', '13h19', 'Midday', '13h30', '10h45', '11h20', '11h45',
       '19h30', '08h30', '15h45', 'Shortly before 12h00', '17h34',
       '17h10', '11h15', '08h50', '17h45', '13h00', '10h20', '13h20',
       '02h00', '09h50', '11h30', '17h30', '9h00', '10h43', 'After noon',
       '15h15', '15h40', '19h05', '1300', '14h30 / 15h30', '16h20',
       '14h34', '15h25', '14h55', '17h46', 'Morning ', '15h49', '19h00',
       'Midnight', '09h30 / 10h00', '10h15', '18h15', '04h00', '14h50',
       '13h50', '19h20', '10h25', '10h45-11h15', '16h45', '15h52',
       '06h15', '14h40', '19h45', '10h10', '08h45', 'Evening', '12h10',
       '18h05', '11h41', '12h25', '17h51', '16h12', '12h45', '10h50',
       '14h15', '09h45', '06h45', '05h00', '03h30',
       'Sometime between 06h00 & 08hoo', '06h30', '17h20', '20h00',
       '16h40', '16h18', '11h10', 'Early afternoon', '17h50',
       '07h00 - 08h00', '18h15-18h30', '17h01', '09h57', '08h20', '17h58',
       '20h30', '15h19', '10h55', '15h55', '23h00', '12h40', '13h55',
       '16h05', '14h10', '15h20', '12h50', '14h45', '13h40', '13h24',
       '09h00 - 09h30', '0830', '11h40', '08h10', '15h56', '14h20',
       'Just before noon', '07h56', '1600', '17h17', '16h35', '09h05',
       '07h15', '07h20', '19h28', '12h38', '05h50', '15h50', '11h05',
       'Early morning', 'Dawn', '05h45', '13h25', '12h20', '13h26',
       '09h11', '12h15', '13h15', '18h20', '15h35', 'AM', '13h51', 'A.M.',
       '08h05', '19h15', '10h35', '15h44', 'Dusk', '21h00', 'Lunchtime',
       '15j45', '09h35', '10h27', '10h16', '0500', 'Before 07h00',
       '09h20', '10h00 -- 11h00', '12h05', '14h21', '18h50', '15h53',
       '"Just before 11h00"', '11h115', '13h42', '20h15', '12h39',
       '07h05', 'Sunset', '  ', '13h05', '11h50', '"Evening"',
       'Just before sundown', '17h55', '22h30', '17h15', '16h10',
       '11h30 ', '06h10', '16h15', 'Between 05h00 and 08h00', '07h08',
       '17h00 or 17h40', '03h00', '>08h00', '--', '12h02', '12h55',
       '16h14', '17h11', '00h30', '14h37', '10h07', '13h53', '11h55',
       '13h23', 'Just after 12h00', '02h30', '08h40', '11h56', '14h35',
       ' ', 'Early Morning', '07h50', 'Shortly after midnight', '14h25',
       '13h345', '\xa0 ', '06h47', '09h00 -10h00', '20h45 (Sunset)',
       'Late morning', 'P.M.', '18h40', '13h14', '13h06',
       'Shortly before 13h00', '12h34', '11h53', '8:04 pm', '12h46',
       '12h48', '17h42', '12h35', 'Possibly same incident as 2000.08.21',
       'After Dusk', '11h57', 'Noon', '17h40', '11h25', '18h25', '10h28',
       '09h15', '14h16', '09h55', '2 hours after Opperman', '15h05',
       '09h30 ', 'Mid afternoon', 'Mid morning', '11h48', '11h00 / 11h30',
       '07h19', '13h37', '11h06', '"Night"', '18h30?', '11h58', '11h51',
       '18h12', '07h10', '07h40', '12h33',
       '30 minutes after 1992.07.08.a', '>06h45', '15h06', '12h54',
       'Between 06h00 & 07h20', '16h55', '05h40', '<07h30', '21h30',
       '17h00 Sunset', 'Nightfall', 'X', '08h57', '18h30 (Sunset)',
       '06j00', '08h35', '10h22', '02h45', 'Prior to 10h37', 'Daybreak',
       '18h10', '>12h00', 'Mid-morning', '08h55', '16h30 or 18h00',
       'Just before dawn', ' 14h00', 'Daytime', '06h50', '01h00', 'Dark',
       '10h00 / 11h00', '"After lunch"', '07h32', '15h00 or 15h45',
       '>17h00', '19h00 / 20h00', '12h45 / 13h45', '14h00 - 15h00',
       'night', '03h45 - 04h00', '13h10', '09h30 / 15h30',
       '08h00 / 09h30', '19h35', '12h00 to 14h00', '13h35', 'Late night',
       '01h32', '10h30 or 13h30', '16h23', '15h00j', 'Midday.',
       '"After dark"', '10h00 or 14h00', '19h10', '16h25',
       '2 hrs before sunset', '18h15 to 21h30', '1500',
       '"shortly before dusk"', '>17h30', '>14h30',
       'Between 11h00 & 12h00', 'After 04h00',
       '11h01 -time of ship sinking', 'Ship aban-doned at 03h10', '19h55',
       'After dusk',
       'FATAL  (Wire netting installed at local beaches after this incident.)',
       '01h30', 'After midnight', 'Late afternon', '05h30', '08h58',
       '"Early evening"', 'Late Afternoon', '   ', 'Before daybreak',
       'dusk', 'Before 10h30', '06h00 -- 07h00', '01h50', '17h00-18h00',
       '19h00-20h00'], dtype=object)

Viendo que el porcentaje de nulos de la columna *'time'* supera el 50%, decidimos investigar un poco más sobre sus datos. Observamos que hay mucha diferencia en como se han resgistrado los datos, por lo que sería muy dificil sacar conclusiones de los mismos. Así que, decidimos eliminarla.

In [28]:
del df['time']

In [29]:
#Comprobamos que la columna se ha eliminado.
df.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'age', 'species_', 'injury', 'fecha_limpia',
       'fatal_clean', 'sexo'],
      dtype='object')

2. Es el momento de eliminar los nulos:

- Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [ ]:
media_age = df['age'].mean().round(2)  #Tenemos que limpiar la columna en el pair 2

In [ ]:
df['age'].fillna(df['age'].mean.round(2), inplace = True)

- En relación a la columna de country al tratarse de una columna de tipo categórica, reemplazad los valores nulos por una nueva categória que se llame Unknown.

In [30]:
df['country'].replace(np.nan, 'unknown', inplace=True)

In [31]:
#Comprobamos que se han producido los cambios
df.head()

,case_number,year,type,country,area,location,activity,name,age,species_,injury,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,"FATAL, all onboard were killed by sharks",NaN,Y,F
1,1797.05.28.R,1797,Unprovoked,unknown,NaN,NaN,Dropped overboard,child,NaN,NaN,FATAL,May,Y,NaN
2,1792.09.12,1792,Provoked,england,NaN,On the Thames River,Fishing,male,NaN,NaN,"FATAL, PROVOKED INCIDENT",Sep,Y,M
3,1791.00.00,1791,Unprovoked,australia,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",NaN,NaN,"FATAL, ""bitten in two""",NaN,Y,F
4,1788.05.10,1788,Boat,australia,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,"No injury to occupants, shark bit oar and rudder",May,N,NaN

- Reemplazad los valores nulos de la columna fatal por Unknown

In [32]:
df['fatal_clean'].replace(np.nan, 'Unknown', inplace=True)

In [33]:
df['fatal_clean'].unique()

array(['Y', 'N', 'Unknown'], dtype=object)

- Reemplazad los valores nulos de la columna type por el valor más frecuente (la moda)

In [34]:
df_copia = df.copy()

In [35]:
# value_count_antes = df_copia['type'].value_counts()
# value_count_antes
#Queremos la diferencia con la moda

Unprovoked      4584
Provoked         572
Invalid          542
Sea Disaster     239
Boating          203
Boat             137
Questionable       2
Boatomg            1
Name: type, dtype: int64

In [36]:
df['type'].fillna(df['type'].mode(), inplace = True)

In [37]:
value_count_despues = df['type'].value_counts()
value_count_despues

Unprovoked      4584
Provoked         572
Invalid          542
Sea Disaster     239
Boating          203
Boat             137
Questionable       2
Boatomg            1
Name: type, dtype: int64

- Reemplazad los valores nulos de la columna fecha por Unknown

In [17]:
df['fecha_limpia'].replace(np.nan, 'Unknown', inplace=True)

3. Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair

In [18]:
df.to_csv('utilizar_limpio.csv')